src/InformationRegisters/Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат/Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат</name>
  <resources>
    <name>ДоступностьДилеру</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Производство</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Надстройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Логистика</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>КлючеваяДата</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ОбъектыКлючевыхДат/Scan_ОбъектыКлючевыхДат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ОбъектыКлючевыхДат</name>
  <enumValues>
    <name>ЗаказНаЗавод</name>
  </enumValues>
  <enumValues>
    <name>Изделие</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЗакупку</name>
  </enumValues>
</mdclass:Enum>

src/CommonForms/Scan_НастройкаКлючевыхДатВЗаказеНаЗаводПоГруппам/Module.bsl
//rarus BProg_Dekin 31.10.2019 mantis 0014452 +- Добалена форма.

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектКлючевойДаты = Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод;
	НастройкиИзРегистра = РегистрыСведений.Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.ПолучитьНастройки(Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод);
	НастройкиКлючевыхДат.Загрузить(НастройкиИзРегистра);
	
	Scan_СборСтатистики.Scan_ПриОткрытииФормы(ЭтотОбъект.ИмяФормы); // Rarus tenkam 11.04.2022 mantis 18433 +

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьПослеПодтверждения();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьПослеПодтверждения", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаписатьИЗакрытьПослеПодтверждения(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Отказ = Ложь;
	ЗаписатьНаСервере(Отказ);
	
	Если НЕ Отказ тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере(Отказ)
	Для Каждого Строка Из НастройкиКлючевыхДат Цикл
		Отказ = РегистрыСведений.Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.ЗаписьЗначенияРегистраСведения(Строка.КлючеваяДата, Строка);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
